```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.court_document_package_anonymiser.github_actions_secret.repository_secret["MANAGEMENT_ACCOUNT_NUMBER"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-court-document-package-anonymiser"
      + secret_name     = "MANAGEMENT_ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```